#include <iostream>
using namespace std;

void Inputcorrectness(char [3][3]); //Прототип функции хода

int main(){
    setlocale(LC_ALL, "RU");

    char arr[3][3] = { //Массив для значков
    {'_', '_', '_'},
    {'_', '_', '_'},
    {'_', '_', '_'}
    };
    
    Inputcorrectness(arr); //Вызов функции ходов

    return 0;
}

void Inputcorrectness(char x[3][3]) { //Функция хода

    int strin, column; 
    char sim;

    //Вывод  стартового поля
    cout << "   1" << "   2" << "   3" << endl 
    << "1  " << x[0][0] << " | " << x[0][1] << " | " << x[0][2] << endl
    << "   -" << "-+-" << "-" << "-+-" << "-" << endl
    << "2  " << x[1][0] << " | " << x[1][1] << " | " << x[1][2] << endl
    << "   -" << "-+-" << "-" << "-+-" << "-" << endl
    << "3  " << x[2][0] << " | " << x[2][1] << " | " << x[2][2] << endl;

    for (int i = 0; i < 9; i++) { 

        //Проверка на очередность хода
        sim = (i % 2 == 0) ? 'X' : 'O';

        //Выбор клетки для хода
        cout << "Ход '" << sim << "' строка : ";
        cin >> strin;
        cout << "Ход '" << sim << "' столбец : ";
        cin >> column;

        //Проверка на корректность клетки
        if (strin > 3 or strin< 1 or column < 1 or column >3) {
            cout << "НЕКОРРЕКТНО ВЫБРАНА КЛЕТКА" << endl;
            i--;
            continue;
        }

        //Проверка на свободность клетки
        if ((x[strin - 1][column - 1] != 'O') and (x[strin - 1][column - 1] != 'X')) 
            x[strin - 1][column - 1] = sim;
        else {
            cout << "ЭТА КЛЕТКА УЖЕ ЗАНЯТА!" << endl ;
            i--;
            continue;
        }
         

        //Вывод поля с совершенным ходом
        cout << "   1" << "   2" << "   3" << endl
        << "1  " << x[0][0] << " | " << x[0][1] << " | " << x[0][2] << endl
        << "   -" << "-+-" << "-" << "-+-" << "-" << endl
        << "2  " << x[1][0] << " | " << x[1][1] << " | " << x[1][2] << endl
        << "   -" << "-+-" << "-" << "-+-" << "-" << endl
        << "3  " << x[2][0] << " | " << x[2][1] << " | " << x[2][2] << endl;

    }
}