#include <iostream>
using namespace std;

void Inputcorrectness(char [3][3]); //Прототип функции хода

int Win(char[3][3], char); //Прототип функции победы

int main(){
    setlocale(LC_ALL, "RU");

    for (int i = 0; i < 1; i++) {//Добавление рестарта, по сути бесконечный цикл (i--)
        char arr[3][3] = { //Массив для значков
        {'_', '_', '_'},
        {'_', '_', '_'},
        {'_', '_', '_'}
        };
        int otvet;
        Inputcorrectness(arr); //Вызов функции ходов
        cout << " Игра окончена. Желаете ли вы повторить?" << endl
            << "1 - Начать заново" << endl << "2 - Завершить" << endl;
        cin >> otvet;
        if (otvet == 1)
            i--; //Возможность продолжить циккл - рестарт
    }

    return 0;
}

void Inputcorrectness(char x[3][3]) { //Функция хода

    int strin, column; 
    char sim;

    //Вывод  стартового поля
    cout << "   1" << "   2" << "   3" << endl 
    << "1  " << x[0][0] << " | " << x[0][1] << " | " << x[0][2] << endl
    << "   -" << "-+-" << "-" << "-+-" << "-" << endl
    << "2  " << x[1][0] << " | " << x[1][1] << " | " << x[1][2] << endl
    << "   -" << "-+-" << "-" << "-+-" << "-" << endl
    << "3  " << x[2][0] << " | " << x[2][1] << " | " << x[2][2] << endl;

    for (int i = 0; i < 9; i++) { 
        //По окончанию цикла, то есть, когда ходы закончатся, игра завершится, а значит наступит ничья -
        // - отдельный функционал создавать не придется.

        //Проверка на очередность хода
        sim = (i % 2 == 0) ? 'X' : 'O';

        //Выбор клетки для хода
        cout << "Ход '" << sim << "' строка : ";
        cin >> strin;
        cout << "Ход '" << sim << "' столбец : ";
        cin >> column;

        //Проверка на корректность клетки
        if (strin > 3 or strin< 1 or column < 1 or column >3) {
            cout << "НЕКОРРЕКТНО ВЫБРАНА КЛЕТКА" << endl;
            i--;
            continue;
        }

        //Проверка на свободность клетки
        if ((x[strin - 1][column - 1] != 'O') and (x[strin - 1][column - 1] != 'X')) 
            x[strin - 1][column - 1] = sim;
        else {
            cout << "ЭТА КЛЕТКА УЖЕ ЗАНЯТА!" << endl ;
            i--;
            continue;
        }
         
        //Вывод поля с совершенным ходом
        cout << "   1" << "   2" << "   3" << endl
        << "1  " << x[0][0] << " | " << x[0][1] << " | " << x[0][2] << endl
        << "   -" << "-+-" << "-" << "-+-" << "-" << endl
        << "2  " << x[1][0] << " | " << x[1][1] << " | " << x[1][2] << endl
        << "   -" << "-+-" << "-" << "-+-" << "-" << endl
        << "3  " << x[2][0] << " | " << x[2][1] << " | " << x[2][2] << endl;

        if (Win(x, sim) == 1)
            return;
    }
}

int Win(char z[3][3], char sim) { //Функция победы
    for (int i = 0; i < 3; i++) {
        if (
            (z[i][0] == z[i][1] and z[i][0]== z[i][2] and z[i][0] == sim) or 
            (z[0][i] == z[1][i] and z[0][i] == z[2][i] and z[0][i] == sim) or 
            (z[0][0] == z[1][1] and z[0][0] == z[2][2] and z[0][0] == sim) or
            (z[0][2] == z[1][1] and z[0][2] == z[2][0] and z[0][2] == sim)
            ) {
            cout << "Победа '" << sim << "'!";
            return 1;
        }
    }
    return 0;
}